src/test/resources/walletpayment/getPaymentRecord/getPaymentRecordRequestMinimal.xml

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:getPaymentRecordRequest xmlns="http://obj.ws.payline.experian.com" xmlns:ns2="http://impl.ws.payline.experian.com">
            <ns2:version>99</ns2:version>
            <ns2:contractNumber>contractNumber</ns2:contractNumber>
            <ns2:paymentRecordId>paymentRecordId 5</ns2:paymentRecordId>
        </ns2:getPaymentRecordRequest>
    </S:Body>
</S:Envelope>